koffes/sdk-nrf/applications/nrf5340_audio/src/bluetooth/le_audio_cis_gateway.c
	if (params->err == BT_ATT_ERR_ATTRIBUTE_NOT_FOUND) {
		LOG_WRN("No sources found");
		return;
	} else if (params->err) {
		LOG_ERR("Discovery failed: %d", params->err);
		return;
	}

	ret = temp_cap_index_get(conn, &temp_cap_index);
	if (ret) {
		LOG_ERR("Could not get temporary CAP storage index");
		return;
	}

	if (codec != NULL) {
		if (codec->id != BT_CODEC_LC3_ID) {
			LOG_DBG("Only the LC3 codec is supported");
			return;
		}

		/* params->num_caps is an increasing index that starts at 0 */
		if (params->num_caps <= ARRAY_SIZE(temp_cap[temp_cap_index].codec)) {
			struct bt_codec *store_loc =
				&temp_cap[temp_cap_index].codec[params->num_caps];

			memcpy(store_loc, codec, sizeof(struct bt_codec));

			for (int i = 0; i < codec->data_count; i++) {
				store_loc->data[i].data.data = store_loc->data[i].value;
			}

			for (int i = 0; i < codec->meta_count; i++) {
				store_loc->meta[i].data.data = store_loc->meta[i].value;
			}
		} else {
			LOG_WRN("No more space. Increase CODEC_CAPAB_COUNT_MAX");
		}

		return;
	}

	ret = channel_index_get(conn, &channel_index);
	if (ret) {
		LOG_ERR("Unknown connection, should not reach here");
		return;
	}

	/* At this point the location/channel index of the headset is always known */
	for (int i = 0; i < CONFIG_CODEC_CAP_COUNT_MAX; i++) {
		memcpy(&headsets[channel_index].source_codec_cap[i],
		       &temp_cap[temp_cap_index].codec, (sizeof(struct bt_codec)));
	}

	if (ep != NULL) {
		/* params->num_eps is an increasing index that starts at 0 */
		if (params->num_eps > 0) {
			LOG_WRN("More than one src endpoints found, ep idx 0 is used by default");
			return;
		}

		headsets[channel_index].source_ep = ep;
		return;
	}

	if (headsets[channel_index].source_ep == NULL) {
		LOG_WRN("No source endpoints found");
		return;
	}

	LOG_DBG("Source discover complete: err %d", params->err);

	(void)memset(params, 0, sizeof(*params));

	if (valid_codec_cap_check(headsets[channel_index].source_codec_cap,
				  ARRAY_SIZE(headsets[channel_index].source_codec_cap))) {
		if (conn == headsets[AUDIO_CH_L].headset_conn) {
			bt_codec_allocation_set(&lc3_preset_source.codec,
						BT_AUDIO_LOCATION_FRONT_LEFT);
		} else if (conn == headsets[AUDIO_CH_R].headset_conn) {
			bt_codec_allocation_set(&lc3_preset_source.codec,
						BT_AUDIO_LOCATION_FRONT_RIGHT);
		} else {
			LOG_ERR("Unknown connection, cannot set allocation");
		}

		ret = bt_bap_stream_config(conn, &headsets[channel_index].source_stream,
					   headsets[channel_index].source_ep,
					   &lc3_preset_source.codec);
		if (ret) {
			LOG_WRN("Could not configure stream");
		}
	} else {
		LOG_WRN("No valid codec capability found for %s headset source",
			headsets[channel_index].ch_name);
	}

	/* Free up the slot in temp_cap */
	memset(temp_cap[temp_cap_index].codec, 0, sizeof(temp_cap[temp_cap_index].codec));
	temp_cap[temp_cap_index].conn = NULL;
}
#endif /* (CONFIG_BT_AUDIO_RX) */

static void disconnected_headset_cleanup(uint8_t chan_idx)
{
	headsets[chan_idx].headset_conn = NULL;
	k_work_cancel_delayable(&headsets[chan_idx].stream_start_sink_work);
	headsets[chan_idx].sink_ep = NULL;
	memset(headsets[chan_idx].sink_codec_cap, 0, sizeof(headsets[chan_idx].sink_codec_cap));
	k_work_cancel_delayable(&headsets[chan_idx].stream_start_source_work);
	headsets[chan_idx].source_ep = NULL;
	memset(headsets[chan_idx].source_codec_cap, 0, sizeof(headsets[chan_idx].source_codec_cap));
}

static int discover_sink(struct bt_conn *conn)
{
	int ret = 0;
	static uint8_t discover_index;

	audio_sink_discover_param[discover_index].func = discover_sink_cb;
	audio_sink_discover_param[discover_index].dir = BT_AUDIO_DIR_SINK;
	ret = bt_bap_unicast_client_discover(conn, &audio_sink_discover_param[discover_index]);
	discover_index++;

	/* Avoid multiple discover procedure sharing the same params */
	if (discover_index >= CONFIG_BT_MAX_CONN) {
		discover_index = 0;
	}

	return ret;
}

#if (CONFIG_BT_AUDIO_RX)
static int discover_source(struct bt_conn *conn)
{
	int ret = 0;
	static uint8_t discover_index;

	audio_source_discover_param[discover_index].func = discover_source_cb;
	audio_source_discover_param[discover_index].dir = BT_AUDIO_DIR_SOURCE;
	ret = bt_bap_unicast_client_discover(conn, &audio_source_discover_param[discover_index]);
	discover_index++;

	/* Avoid multiple discover procedure sharing the same params */
	if (discover_index >= CONFIG_BT_MAX_CONN) {
		discover_index = 0;
	}

	return ret;
}
#endif /* (CONFIG_BT_AUDIO_RX) */

#if (CONFIG_BT_MCS)
/**
 * @brief	Callback handler for play/pause.
 *
 * @note	This callback is called from MCS after receiving a
 *		command from the client or the local media player.
 *
 * @param[in]	play  Boolean to indicate if the stream should be resumed or paused.
 */
static void le_audio_play_pause_cb(bool play)
{
	int ret;

	LOG_DBG("Play/pause cb, state: %d", play);

	if (play) {
		if (ep_state_check(headsets[AUDIO_CH_L].sink_stream.ep,
				   BT_BAP_EP_STATE_QOS_CONFIGURED)) {
			ret = bt_bap_stream_enable(&headsets[AUDIO_CH_L].sink_stream,
						   lc3_preset_sink.codec.meta,
						   lc3_preset_sink.codec.meta_count);

			if (ret) {
				LOG_WRN("Failed to enable left stream");
			}
		}

		if (ep_state_check(headsets[AUDIO_CH_R].sink_stream.ep,
				   BT_BAP_EP_STATE_QOS_CONFIGURED)) {
			ret = bt_bap_stream_enable(&headsets[AUDIO_CH_R].sink_stream,
						   lc3_preset_sink.codec.meta,
						   lc3_preset_sink.codec.meta_count);

			if (ret) {
				LOG_WRN("Failed to enable right stream");
			}
		}
	} else {
		le_audio_event_publish(LE_AUDIO_EVT_NOT_STREAMING);

		if (ep_state_check(headsets[AUDIO_CH_L].sink_stream.ep,
				   BT_BAP_EP_STATE_STREAMING)) {
			ret = bt_bap_stream_disable(&headsets[AUDIO_CH_L].sink_stream);

			if (ret) {
				LOG_WRN("Failed to disable left stream");
			}
		}

		if (ep_state_check(headsets[AUDIO_CH_R].sink_stream.ep,
				   BT_BAP_EP_STATE_STREAMING)) {
			ret = bt_bap_stream_disable(&headsets[AUDIO_CH_R].sink_stream);

			if (ret) {
				LOG_WRN("Failed to disable right stream");
			}
		}
	}

	playing_state = play;
}
#endif /* CONFIG_BT_MCS */

static int iso_stream_send(uint8_t const *const data, size_t size, struct le_audio_headset headset)
{
	int ret;
	struct net_buf *buf;

	/* net_buf_alloc allocates buffers for APP->NET transfer over HCI RPMsg,
	 * but when these buffers are released it is not guaranteed that the
	 * data has actually been sent. The data might be queued on the NET core,
	 * and this can cause delays in the audio.
	 * When stream_sent_cb() is called the data has been sent.
	 * Data will be discarded if allocation becomes too high, to avoid audio delays.
	 * If the NET and APP core operates in clock sync, discarding should not occur.
	 */
	if (atomic_get(&headset.iso_tx_pool_alloc) >= HCI_ISO_BUF_ALLOC_PER_CHAN) {
		if (!headset.hci_wrn_printed) {
			LOG_WRN("HCI ISO TX overrun on %s ch - Single print", headset.ch_name);
			headset.hci_wrn_printed = true;
		}

