koffes/sdk-nrf/applications/nrf5340_audio/src/bluetooth/le_audio_cis_gateway.c
		return -ENOMEM;
	}

	headset.hci_wrn_printed = false;

	buf = net_buf_alloc(headset.iso_tx_pool, K_NO_WAIT);
	if (buf == NULL) {
		/* This should never occur because of the iso_tx_pool_alloc check above */
		LOG_WRN("Out of TX buffers");
		return -ENOMEM;
	}

	net_buf_reserve(buf, BT_ISO_CHAN_SEND_RESERVE);
	net_buf_add_mem(buf, data, size);

	atomic_inc(&headset.iso_tx_pool_alloc);

	ret = bt_bap_stream_send(&headset.sink_stream, buf,
				 get_and_incr_seq_num(&headset.sink_stream), BT_ISO_TIMESTAMP_NONE);
	if (ret < 0) {
		LOG_WRN("Failed to send audio data to %s: %d", headset.ch_name, ret);
		net_buf_unref(buf);
		atomic_dec(&headset.iso_tx_pool_alloc);
	}

	return 0;
}

static int initialize(le_audio_receive_cb recv_cb, le_audio_timestamp_cb timestmp_cb,
		      le_audio_nonvalid_iso_cfgs_cb nonvalid_cfgs_cb)
{
	int ret;
	static bool initialized;
	int headset_iterator = 0;
	int stream_iterator = 0;
	struct bt_bap_unicast_group_stream_pair_param pair_params[ARRAY_SIZE(headsets)];
	/* 2 streams (one sink and one source stream) for each headset */
	struct bt_bap_unicast_group_stream_param stream_params[(ARRAY_SIZE(headsets) * 2)];
	struct bt_bap_unicast_group_param param;

	if (initialized) {
		LOG_WRN("Already initialized");
		return -EALREADY;
	}

	if (recv_cb == NULL) {
		LOG_ERR("Receieve callback is NULL");
		return -EINVAL;
	}

	if (timestmp_cb == NULL) {
		LOG_ERR("Timestamp callback is NULL");
		return -EINVAL;
	}

	receive_cb = recv_cb;
	timestamp_cb = timestmp_cb;
	nonvalid_configs_cb = nonvalid_cfgs_cb;

	for (int i = 0; i < ARRAY_SIZE(headsets); i++) {
		headsets[i].sink_stream.ops = &stream_ops;
		headsets[i].source_stream.ops = &stream_ops;
		k_work_init_delayable(&headsets[i].stream_start_sink_work, work_stream_start);
		k_work_init_delayable(&headsets[i].stream_start_source_work, work_stream_start);
	}

	ret = bt_bap_unicast_client_register_cb(&unicast_client_cbs);
	if (ret != 0) {
		LOG_ERR("Failed to register client callbacks: %d", ret);
		return ret;
	}

	for (int i = 0; i < ARRAY_SIZE(headsets); i++) {
		headsets[i].iso_tx_pool = iso_tx_pools[i];
		switch (i) {
		case AUDIO_CH_L:
			headsets[i].ch_name = "LEFT";
			break;
		case AUDIO_CH_R:
			headsets[i].ch_name = "RIGHT";
			break;
		default:
			LOG_WRN("Trying to set name to undefined channel");
			headsets[i].ch_name = "UNDEFINED";
			break;
		}
	}

	for (int i = 0; i < ARRAY_SIZE(stream_params); i++) {
		/* Every other stream should be sink or source */
		if ((i % 2) == 0) {
			stream_params[i].qos = &lc3_preset_sink.qos;
			stream_params[i].stream = &headsets[headset_iterator].sink_stream;
		} else {
			stream_params[i].qos = &lc3_preset_source.qos;
			stream_params[i].stream = &headsets[headset_iterator].source_stream;
			headset_iterator++;
		}
	}

	for (int i = 0; i < ARRAY_SIZE(pair_params); i++) {
		pair_params[i].tx_param = &stream_params[stream_iterator];
		stream_iterator++;
#if (CONFIG_BT_AUDIO_RX)
		pair_params[i].rx_param = &stream_params[stream_iterator];
#else
		pair_params[i].rx_param = NULL;
#endif /* (CONFIG_BT_AUDIO_RX) */
		stream_iterator++;
	}

	param.params = pair_params;
	param.params_count = ARRAY_SIZE(pair_params);

	if (IS_ENABLED(CONFIG_BT_AUDIO_PACKING_INTERLEAVED)) {
		param.packing = BT_ISO_PACKING_INTERLEAVED;
	} else {
		param.packing = BT_ISO_PACKING_SEQUENTIAL;
	}

	ret = bt_bap_unicast_group_create(&param, &unicast_group);
	if (ret) {
		LOG_ERR("Failed to create unicast group: %d", ret);
		return ret;
	}

#if (CONFIG_BT_MCS)
	ret = ble_mcs_server_init(le_audio_play_pause_cb);
	if (ret) {
		LOG_ERR("MCS server init failed");
		return ret;
	}
#endif /* CONFIG_BT_MCS */

	initialized = true;

	return 0;
}

int le_audio_user_defined_button_press(enum le_audio_user_defined_action action)
{
	return 0;
}

int le_audio_config_get(uint32_t *bitrate, uint32_t *sampling_rate, uint32_t *pres_delay)
{
	LOG_WRN("Getting config from gateway is not yet supported");
	return -ENOTSUP;
}

void le_audio_conn_set(struct bt_conn *conn)
{
	int ret;

	ret = discover_sink(conn);
	if (ret) {
		LOG_WRN("Failed to discover sink: %d", ret);
	}
}

void le_audio_conn_disconnected(struct bt_conn *conn)
{
	int ret;
	uint8_t channel_index;

	ret = channel_index_get(conn, &channel_index);
	if (ret) {
		LOG_WRN("Unknown connection disconnected");
	} else {
		disconnected_headset_cleanup(channel_index);
	}
}

int le_audio_ext_adv_set(struct bt_le_ext_adv *ext_adv)
{
	LOG_WRN("No extended advertiser in CIS gateway");
	return -ENOTSUP;
}

void le_audio_adv_get(const struct bt_data **adv, size_t *adv_size, bool periodic)
{
	LOG_WRN("No advertiser in CIS gateway");
}

int le_audio_play_pause(void)
{
	int ret;

	if (IS_ENABLED(CONFIG_STREAM_BIDIRECTIONAL)) {
		LOG_WRN("Play/pause not supported for bidirectional mode");
	} else {
		ret = ble_mcs_play_pause(NULL);
		if (ret) {
			LOG_WRN("Failed to change streaming state");
			return ret;
		}
	}

	return 0;
}

int le_audio_send(struct encoded_audio enc_audio)
{
	int ret;
	size_t data_size_pr_stream;
	struct bt_iso_tx_info tx_info = {0};

	if ((enc_audio.num_ch == 1) || (enc_audio.num_ch == ARRAY_SIZE(headsets))) {
		data_size_pr_stream = enc_audio.size / enc_audio.num_ch;
	} else {
		LOG_ERR("Num encoded channels must be 1 or equal to num headsets");
		return -EINVAL;
	}

	if (data_size_pr_stream != LE_AUDIO_SDU_SIZE_OCTETS(CONFIG_BT_AUDIO_BITRATE_UNICAST_SINK)) {
		LOG_ERR("The encoded data size does not match the SDU size");
		return -EINVAL;
	}

	if (ep_state_check(headsets[AUDIO_CH_L].sink_stream.ep, BT_BAP_EP_STATE_STREAMING)) {
		ret = bt_iso_chan_get_tx_sync(&headsets[AUDIO_CH_L].sink_stream.ep->iso->chan,
					      &tx_info);
	} else if (ep_state_check(headsets[AUDIO_CH_R].sink_stream.ep, BT_BAP_EP_STATE_STREAMING)) {
		ret = bt_iso_chan_get_tx_sync(&headsets[AUDIO_CH_R].sink_stream.ep->iso->chan,
					      &tx_info);
	} else {
		/* This can happen if a headset is reset and the state in
		 * streamctrl hasn't had time to update yet
		 */
		LOG_DBG("No headset in stream state");
		return -ECANCELED;
	}

	if (ret) {
		LOG_DBG("Error getting ISO TX anchor point: %d", ret);
	}

	if (tx_info.ts != 0 && !ret) {
		if (!IS_ENABLED(CONFIG_STREAM_BIDIRECTIONAL)) {
			timestamp_cb(tx_info.ts, true);
		}
	}

	if (ep_state_check(headsets[AUDIO_CH_L].sink_stream.ep, BT_BAP_EP_STATE_STREAMING)) {
		ret = iso_stream_send(enc_audio.data, data_size_pr_stream, headsets[AUDIO_CH_L]);
		if (ret) {
			LOG_DBG("Failed to send data to left channel");
		}
	}

	if (ep_state_check(headsets[AUDIO_CH_R].sink_stream.ep, BT_BAP_EP_STATE_STREAMING)) {
		if (enc_audio.num_ch == 1) {
			ret = iso_stream_send(enc_audio.data, data_size_pr_stream,
					      headsets[AUDIO_CH_R]);
		} else {
			ret = iso_stream_send(&enc_audio.data[data_size_pr_stream],
					      data_size_pr_stream, headsets[AUDIO_CH_R]);
		}
		if (ret) {
			LOG_DBG("Failed to send data to right channel");
		}
	}

	return 0;
}

int le_audio_enable(le_audio_receive_cb recv_cb, le_audio_timestamp_cb timestmp_cb,
		    le_audio_nonvalid_iso_cfgs_cb nonvalid_cfgs_cb)
{
	int ret;

	ret = initialize(recv_cb, timestmp_cb, nonvalid_cfgs_cb);
	if (ret) {
		return ret;
	}

	return 0;
}

int le_audio_disable(void)
{
	return 0;
}
